# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'neovide'
brew 'rbenv'
brew 'redis'
brew 'imagemagick'
brew 'poppler'
brew 'postgresql@16', link: true
brew 'qpdf'
brew 'shared-mime-info'
brew 'volta'
brew 'hivemind'
brew 'wget'

# Apps
#cask '1password'
cask 'caffeine'
cask 'discord'
#cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tuple'
cask 'visual-studio-code'
#cask 'zoom'
cask 'rectangle'
cask 'wezterm'

# Mac App Store
mas 'Things', id: 904280696

